renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/include/MS_common.h
/** Device UUID Size */
#define MS_DEVICE_UUID_SIZE    16

/** Beacon Type - Size */
#define MS_BCON_TYPE_SIZE      1

/** Beacon OOB Indicator Size */
#define MS_BCON_OOB_IND_SIZE   2

/** Beacon URI Hash Size */
#define MS_BCON_URI_HASH_SIZE   4

/** \name Beacon Types
 *  \{
 */
/** Unprovisioned Device Beacon Type */
#define MS_BCON_TYPE_UNPRVSNG_DEV    0x00

/** Secure Network Beacon Type */
#define MS_BCON_TYPE_SECURE          0x01

/** \} */

/** \name Friend Role
 *  \{
 */
/** Invalid */
#define MS_FRND_ROLE_INVALID   0x00

/** Friend */
#define MS_FRND_ROLE_FRIEND    0x01

/** LPN */
#define MS_FRND_ROLE_LPN       0x02

/** \} */

/** \name Feature
 *  \{
 */
/** Relay Feature */
#define MS_FEATURE_RELAY    0x00
/** Proxy Feature */
#define MS_FEATURE_PROXY    0x01
/** Friend Feature */
#define MS_FEATURE_FRIEND   0x02
/** Low Power Feature */
#define MS_FEATURE_LPN      0x03

/** Secure Nework Beacon */
#define MS_FEATURE_SEC_NET_BEACON 0x04

/** \} */

/** \name Operation State
 *  \{
 */
/** Operation: Enable */
#define MS_ENABLE           0x01
/** Operation: Disable */
#define MS_DISABLE          0x00
/**
 * Feature not supported.
 * Used as stutus for Get/Set Friend/Proxy etc.,
 * when the feature is not supported.
 */
#define MS_NOT_SUPPORTED    0x02
/** \} */

/** Network Tx State */
#define MS_NETWORK_TX_STATE            0x00
/** Relay Tx State */
#define MS_RELAY_TX_STATE              0x01

/** Label UUID Length. Associated with Virtual Address */
#define MS_LABEL_UUID_LENGTH           16

/** \} */

/* -------------------------------------------- Structures/Data Types */

/**
 * \defgroup ms_common_structures Structures
 * \ingroup ms_common_module
 * \{
 */
/** Payload type */
typedef struct _MS_BUFFER
{
    /* Payload Pointer */
    UCHAR * payload;

    /* Payload Length */
    UINT16 length;

} MS_BUFFER;

/**
 *  Dynamic configuration of Mesh Datastructure.
 *  Used only if 'MS_HAVE_DYNAMIC_GLOBAL_ARRAY' is defined.
 */
typedef struct _MS_CONFIG
{
#ifdef MS_HAVE_DYNAMIC_GLOBAL_ARRAY
    /** Number of Network Interfaces */
    UINT16 config_MS_NUM_NETWORK_INTERFACES;

    /** Number of Provisioning Interfaces */
    UINT16 config_MS_NUM_PROVISIONING_INTERFACES;

    /** Network Cache Size */
    UINT16 config_MS_NET_CACHE_SIZE;

#ifndef MS_NET_BASIC_SEQNUM_CACHE
    /** Network Sequence Number Cache Size */
    UINT16 config_MS_NET_SEQNUM_CACHE_SIZE;
#endif /* MS_NET_BASIC_SEQNUM_CACHE */

    /** Maximum number of subnets the device can store information about. */
    UINT16 config_MS_MAX_SUBNETS;

    /** Maximum number of device keys the device can store information about. */
    UINT16 config_MS_MAX_DEV_KEYS;

    /** Maximum number of addresses present in each proxy filter list. */
    UINT16 config_MS_PROXY_FILTER_LIST_SIZE;

    /** Maximum number of LPNs. */
    UINT16 config_MS_MAX_LPNS;

    /** The size of Reassembled Cache. */
    UINT16 config_MS_REASSEMBLED_CACHE_SIZE;

    /** Number of Segmentation and Reassembly contexts. */
    UINT16 config_LTRN_SAR_CTX_MAX;

    /**
     *  Maximum number of messages that the friend is capabale to queue
     *  for a single Low Power Node.
     */
    UINT16 config_MS_FRIEND_MESSAGEQUEUE_SIZE;

    /**
     *  Maximum number of subscription addresses that the friend
     *  is capabale to store for a single Low Power Node.
     */
    UINT16 config_MS_FRIEND_SUBSCRIPTION_LIST_SIZE;

    /** Maximum number of elements. */
    UINT16 config_MS_ACCESS_ELEMENT_COUNT;

    /** Maximum number of models. */
    UINT16 config_MS_ACCESS_MODEL_COUNT;

    /**
     *  Maximum number of Applications (keys) the device can store
     *  information about.
     */
    UINT16 config_MS_MAX_APPS;

    /**
     *  Maximum number of Virtual Addresses the device can store
     *  information about.
     */
    UINT16 config_MS_MAX_VIRTUAL_ADDRS;

    /**
     *  Maximum number of Non-Virtual Addresses the device can store
     *  information about.
     */
    UINT16 config_MS_MAX_NON_VIRTUAL_ADDRS;

    /**
     *  The distance between the network sequence numbers, for every persistent
     *  storage write. If the device is powered cycled, it will resume transmission
     *  using the sequence number from start of next block.
     */
    UINT16 config_MS_NET_SEQ_NUMBER_BLOCK_SIZE;

    /** Network Transmit Count for network packets - default value */
    UINT8 config_MS_NET_TX_COUNT;

    /** Network Interval Steps for network packets - default value */
    UINT8 config_MS_NET_TX_INTERVAL_STEPS;

    /** Network Transmit Count for relayed packets - default value */
    UINT8 config_MS_NET_RELAY_TX_COUNT;

    /** Network Interval Steps for relayed packets - default value */
    UINT8 config_MS_NET_RELAY_TX_INTERVAL_STEPS;

    /** Secure Network Beacon Interval - default value */
    UINT16 config_MS_CONFIG_SERVER_SNB_TIMEOUT;

    /**
     * Poxy ADV Network ID timeout for each Subnet in milliseconds.
     */
    UINT16 config_MS_PROXY_SUBNET_NETID_ADV_TIMEOUT;

    /**
     * Poxy ADV Node Identity timeout for each Subnet in milliseconds.
     */
    UINT16 config_MS_PROXY_SUBNET_NODEID_ADV_TIMEOUT;

    /**
     * Poxy ADV Node Identity overall time period in milliseconds.
     */
    UINT32 config_MS_PROXY_NODEID_ADV_TIMEOUT;

    /** Friend Poll Retry Count - default value */
    UINT16 config_MS_FRND_POLL_RETRY_COUNT;

    /** Lower Transport Segment Transmission Timeout in milliseconds */
    UINT16 config_MS_LTRN_RTX_TIMEOUT;

    /** Lower Transport Segment Transmission Count - default value */
    UINT8  config_MS_LTRN_RTX_COUNT;

    /** Lower Transport Acknowledgement Timeout in milliseconds */
    UINT16 config_MS_LTRN_ACK_TIMEOUT;

    /** Lower Transport Incomplete Timeout in milliseconds */
    UINT16 config_MS_LTRN_INCOMPLETE_TIMEOUT;

    /** Friendship Receive Window - default value */
    UINT8  config_MS_FRND_RECEIVE_WINDOW;

    /** Friend Clear Confirmation Timeout in milliseconds */
    UINT16 config_MS_LPN_CLEAR_RETRY_TIMEOUT_INITIAL;

    /** Friendship Retry Timeout in milliseconds */
    UINT16 config_MS_TRN_FRNDREQ_RETRY_TIMEOUT;

    /** Unprovisioned Device Beacon Interleaved Beacon Timeout */
    UINT16 config_MS_UNPROV_DEVICE_BEACON_TIMEOUT;

    /**
     * Maximum number of messages that can be queued in Network layer
     * for Transmission.
     */
    UINT16 config_MS_NET_TX_QUEUE_SIZE;

