renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/include/MS_common.h
    /** Maximum number of Transition Timers */
    UINT16 config_MS_MAX_NUM_TRANSITION_TIMERS;

    /** Maximum number of Periodic Step Timers */
    UINT16 config_MS_MAX_NUM_PERIODIC_STEP_TIMERS;

    /**
     *  Maximum number of Health Server Instances.
     */
    UINT16 config_MS_HEALTH_SERVER_MAX;
#endif /* MS_HAVE_DYNAMIC_GLOBAL_ARRAY */

    /** The size of the Replay Protection cache. */
    UINT16 config_MS_REPLAY_CACHE_SIZE;

    /** Company ID */
    UINT16 config_MS_DEFAULT_COMPANY_ID;

    /** Product ID */
    UINT16 config_MS_DEFAULT_PID;

    /** Vendor ID */
    UINT16 config_MS_DEFAULT_VID;

} MS_CONFIG;

/** \} */

/* -------------------------------------------- Function/API Declarations */
#ifdef __cplusplus
extern "C"{
#endif

#ifdef MS_HAVE_DYNAMIC_CONFIG
/* Global Configuration for Mesh Stack */
extern MS_CONFIG ms_global_config;
#endif /* MS_HAVE_DYNAMIC_CONFIG */

/**
 * \defgroup ms_common_api API Definitions
 * \ingroup ms_common_module
 * \{
 */

/**
 * API to initialize Mesh Stack. This is the first API that the
 * application should call before any other API. This function
 * initializes all the internal stack modules and creates necessary tasks.
 */

/**
 *  \brief To initialize Mesh Stack.
 *
 *  \par Description
 *  API to initialize Mesh Stack. This is the first API that the
 *  application should call before any other API. This function
 *  initializes all the internal stack modules and data structures.
 *
 *  \param [in] blob
 *         If 'MS_HAVE_DYNAMIC_CONFIG' defined,
 *             application shall provide the desired dynamic configuration
 *             using a pointer to MS_CONFIG data structure instance.
 *         else,
 *             this parameter shall be NULL and ignored by the API.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
void MS_init
     (
         /* IN */ void * blob
     );

/**
 * API to turn off Bluetooth Hardware. This API should be called after
 * \ref MS_init.
 *
 * \return
 *      \ref API_RESULT on successful Bluetooth OFF
 */
API_RESULT MS_shutdown
           (
               void
           );

/** \name Transition Timer
 *  \{
 */

/**
 *  \brief To start transition timer.
 *
 *  \par Description
 *  API to start a transition timer.
 *
 *  \param [in] transition
 *         State Transition data structure, which includes the timeout,
 *         transition start and complete callback etc.
 *
 *  \param [out] transition_time_handle
 *         Transition Time Handle, which can be used to stop the transition
 *         timer if required.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_start_transition_timer
           (
               /* IN */  MS_ACCESS_STATE_TRANSITION_TYPE   * transition,
               /* OUT */ UINT16                            * transition_time_handle
           );

/**
 *  \brief To stop transition timer.
 *
 *  \par Description
 *  API to stop a transition timer.
 *
 *  \param [in] transition_time_handle
 *         Transition Time Handle, returned by the Start Transition Timer
 *         interface.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_stop_transition_timer
           (
               /* IN */ UINT16  transition_time_handle
           );

/**
 *  \brief To get remaining Transition Time.
 *
 *  \par Description
 *  API to get remaining Transition Time.
 *
 *  \param [in] transition_time_handle
 *         Transition Time Handle, returned by the Start Transition Timer
 *         interface.
 *
 *  \param [out] remaining_transition_time
 *         Remaining Transition Time.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_get_remaining_transition_time
           (
               /* IN */  UINT16   transition_time_handle,
               /* OUT */ UINT8  * remaining_transition_time
           );

/**
 *  \brief To get remaining Transition Time, with offset.
 *
 *  \par Description
 *  API to get remaining Transition Time with offset in ms.
 *
 *  \param [in] transition_time_handle
 *         Transition Time Handle, returned by the Start Transition Timer
 *         interface.
 *
 *  \param [in] offset_in_ms
 *         Offset in ms.
 *
 *  \param [out] remaining_transition_time
 *         Remaining Transition Time.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_get_remaining_transition_time_with_offset
           (
               /* IN */  UINT16   transition_time_handle,
               /* IN */  UINT32   offset_in_ms,
               /* OUT */ UINT8  * remaining_transition_time
           );

/**
 *  \brief To convert transition time from milisecond.
 *
 *  \par Description
 *  API to convert transition timer in milisecond to Generic Default
 *  Transition Time state format.
 *
 *  \param [in] transition_time_in_ms
 *         Transition Time in milisecond.
 *
 *  \param [out] transition_time
 *         Converted value in Generic Default Transition Time state format.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_get_transition_time_from_ms
           (
               /* IN */  UINT32 transition_time_in_ms,
               /* OUT */ UINT8 * transition_time
           );

/**
 *  \brief To convert transition time to milisecond.
 *
 *  \par Description
 *  API to convert Generic Default Transition Time state format to
 *  required transition time value in miliseconds.
 *
 *  \param [in] transition_time
 *         Transition time in Generic Default Transition Time state format.
 *
 *  \param [out] transition_time_in_ms
 *         Converted value of Transition Time in milisecond.
 *
 *  \return API_SUCCESS or an error code indicating reason for failure
 */
API_RESULT MS_common_get_transition_time_in_ms
           (
               /* IN */  UINT8 transition_time,
               /* OUT */ UINT32 * transition_time_in_ms
           );

/**
 * \cond ignore_this Ignore this function while generating doxygen document
 */

/* Internal Function */
API_RESULT ms_common_init_transition_timer(void);

/**
 * \endcond
 */

/** \} */

#ifdef __cplusplus
};
#endif

/** \} */

/** \} */

#endif /* _H_MS_COMMON_ */

